#include <stdio.h>
/*1) Ввести дійсне число градусів Цельсія C (на екрані повинна бути
підказка, що ввести) та обчислити й вивести число F в дійсному
форматі – та сама температура в градусах Фаренгейта за формулою
. Результат вивести в окремому рядку вигляду «F=*** », де
замість зірок представлення числа в найкоротшому вигляді з
можливих. Цельсий х 1,8 + 32 = Фаренгейт
*/
#include <stdio.h>
int main(){
    float t;
    printf("Градусів за цельсієм t=");
    scanf("%f",&t);
    float f= t * 1.8 + 32;
    printf("F=%.2f", f);

}


/*int main(){
    int x, y;
    x = 15;
    y = 4;

    double z = (double)x/y;
    printf("%lf", z);


}*/